//< --!html 주석 - CSS,java에서 사용 불가능--!>
/* CSS 주석 - 여러줄 주석작성 CSS 주석과 유사*/
// java scrip - 주석 한 줄 주석 처리
//---------------------------
//숫자(number) 값
//---------------------------
//실수
101.21;
//소수
0.871;
//정수
98 -
  //음수
  1.07;
//---------------------------
//문자(string) 값
//---------------------------
//작은 따옴표(')
//단위가 없이 숫자만 혹은 단위가 붙어진
"2px"(
  //큰 따옴표(")
  //프로그램 문장이 끝날 때 마침을 의미하는 세미콜론(;) 추가
  "20mm"
);
//역 따옴표(`,backtick)
`2inch`;

//---------------------------
//논리(boolean) 값
//-진실 (Truthy, true)
//-거짓 (Falsy, false)
//---------------------------
//프로그램이 허용하는 불리언 값
true;
false;

//프로그램이 허용하지 않음 문자 (정의되지 않은 값)
//truthy
//falsy
//yes
//okay
//no

//터미널에 값 출력

//주석 한 줄(single comment)

//주석 여러 줄(multiple comments)

/* 여러 줄
주석 작성
CSS 주석과 유사*/
